In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv('./pandas/MOCK_DATA.csv')

In [3]:
df = pd.DataFrame(data)
df.head()

,first_name,last_name,gender,age,job,tea_or_coffee,rice_or_pasta,hot_dog_or_burger,cat_or_dog
0,Aubree,Tidder,Female,67,Systems Administrator IV,tea,pasta,hot dog,cat
1,Agosto,Croot,Male,20,Actuary,coffee,pasta,burger,cat
2,Rube,Shurman,Genderfluid,36,Paralegal,coffee,pasta,burger,dog
3,Brook,Sarra,Male,39,Engineer I,tea,pasta,hot dog,cat
4,Curr,Penni,Male,44,Office Assistant II,coffee,rice,hot dog,cat

In [4]:
df.tail()

,first_name,last_name,gender,age,job,tea_or_coffee,rice_or_pasta,hot_dog_or_burger,cat_or_dog
995,Belinda,Briscow,Female,84,VP Sales,coffee,rice,hot dog,dog
996,Gregorius,Plumb,Male,90,Quality Engineer,tea,rice,burger,cat
997,Quent,Kissell,Male,76,Software Engineer III,coffee,pasta,hot dog,cat
998,Mattheus,Hamill,Male,82,Tax Accountant,tea,pasta,hot dog,cat
999,Osgood,Morse,Male,57,Help Desk Operator,tea,pasta,hot dog,cat

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   first_name         1000 non-null   object
 1   last_name          1000 non-null   object
 2   gender             1000 non-null   object
 3   age                1000 non-null   int64
 4   job                1000 non-null   object
 5   tea_or_coffee      1000 non-null   object
 6   rice_or_pasta      1000 non-null   object
 7   hot_dog_or_burger  1000 non-null   object
 8   cat_or_dog         1000 non-null   object
dtypes: int64(1), object(8)
memory usage: 70.4+ KB

In [6]:
df.describe()

               age
count  1000.000000
mean     53.551000
std      20.745307
min      18.000000
25%      35.000000
50%      54.000000
75%      71.000000
max      90.000000

In [7]:
df["cat_or_dog"].describe()

count     1000
unique       2
top        dog
freq       525
Name: cat_or_dog, dtype: object

In [8]:
df["rice_or_pasta"].describe()

count      1000
unique        2
top       pasta
freq        507
Name: rice_or_pasta, dtype: object

In [9]:
df["job"].describe()

count          1000
unique          179
top       Librarian
freq             17
Name: job, dtype: object